#### Terraform Workspace 🛠️`vglab`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-vglab/runs/run-4XPkHPehfAAYYcQP

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.openstack_networking_network_v2.bastion: Reading...
openstack_networking_secgroup_v2.bastion: Refreshing state... [id=74fb941d-befb-4eda-9e9f-0291b4ebfa71]
openstack_compute_keypair_v2.bastion: Refreshing state... [id=smslab-bastion]
openstack_networking_secgroup_rule_v2.ssh: Refreshing state... [id=72aeff8d-ef25-44cb-b178-a990d51b230b]
openstack_networking_secgroup_rule_v2.icmp: Refreshing state... [id=1b111b7b-a977-4571-ac11-daa6dfc41917]
data.openstack_networking_network_v2.bastion: Read complete after 2s [id=29174f7a-4b9e-4918-95b2-04e0f9b9e282]
openstack_networking_port_v2.bastion: Refreshing state... [id=4369c6b4-982f-49ab-b21b-1b16072bef49]
openstack_networking_floatingip_associate_v2.bastion: Refreshing state... [id=7add4753-66f1-4edb-ac65-489aa92400db]
openstack_compute_instance_v2.bastion: Refreshing state... [id=2e8c57e8-466e-4bff-956d-99d19e2df41b]
null_resource.host-key: Refreshing state... [id=606048913285471625]
null_resource.sudoers["mark"]: Refreshing state... [id=7455248954534756970]
null_resource.sudoers["michal"]: Refreshing state... [id=5861116657127014182]
null_resource.sudoers["piotr"]: Refreshing state... [id=3114926966998399858]
null_resource.users["tylerc"]: Refreshing state... [id=1994392336397671968]
null_resource.sudoers["stig"]: Refreshing state... [id=7540214147815046436]
null_resource.sudoers["pierre"]: Refreshing state... [id=1423778923469149007]
null_resource.sudoers["bartosz"]: Refreshing state... [id=1863911683895694444]
null_resource.unattended-upgrades: Refreshing state... [id=8486071525636600531]
null_resource.users["matta"]: Refreshing state... [id=4609351468876509758]
null_resource.users["stig"]: Refreshing state... [id=5138280676535238846]
null_resource.users["pierre"]: Refreshing state... [id=5487705842748876683]
null_resource.users["steveb"]: Refreshing state... [id=9199501325167128064]
null_resource.users["alex"]: Refreshing state... [id=5800027764305363128]
null_resource.users["michal"]: Refreshing state... [id=8570051635981648309]
null_resource.users["sms"]: Refreshing state... [id=1105890507400710082]
null_resource.users["dawud"]: Refreshing state... [id=4285197613062117635]
null_resource.users["tom"]: Refreshing state... [id=7079968091015750757]
null_resource.users["doug"]: Refreshing state... [id=6240052105731803952]
null_resource.users["slurm-app-ci"]: Refreshing state... [id=182040308666563772]
null_resource.users["axel"]: Refreshing state... [id=4434177519947776748]
null_resource.users["piotr"]: Refreshing state... [id=2488411759261870]
null_resource.users["bertie"]: Refreshing state... [id=58717091054342353]
null_resource.users["jake"]: Refreshing state... [id=2302067919217311500]
null_resource.users["mark"]: Refreshing state... [id=4595065999535805401]
null_resource.users["rav"]: Refreshing state... [id=7097129762933416140]
null_resource.users["gbialas"]: Refreshing state... [id=6961946213857426218]
null_resource.users["max"]: Refreshing state... [id=2094817774100030862]
null_resource.users["matt"]: Refreshing state... [id=3693470720220720752]
null_resource.users["darmach"]: Refreshing state... [id=5799043828510127374]
null_resource.users["gkoper"]: Refreshing state... [id=2651172285668733418]
null_resource.users["mattc"]: Refreshing state... [id=1959762240421932932]
null_resource.users["scott"]: Refreshing state... [id=8933354983815732457]
null_resource.users["will"]: Refreshing state... [id=4114499945559991749]
null_resource.users["seunghun"]: Refreshing state... [id=3669261540405674997]
null_resource.users["jack"]: Refreshing state... [id=1109540081112905101]
null_resource.users["bartosz"]: Refreshing state... [id=4394238862397787944]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # null_resource.mosh will be created
  + resource "null_resource" "mosh" {
      + id       = (known after apply)
      + triggers = {
          + "host"        = "185.45.78.150"
          + "instance"    = "2e8c57e8-466e-4bff-956d-99d19e2df41b"
          + "private_key" = (sensitive value)
          + "user"        = "ubuntu"
        }
    }

  # null_resource.users["johng"] will be created
  + resource "null_resource" "users" {
      + id       = (known after apply)
      + triggers = {
          + "authorized_keys" = <<-EOT
                sk-ecdsa-sha2-nistp256@openssh.com AAAAInNrLWVjZHNhLXNoYTItbmlzdHAyNTZAb3BlbnNzaC5jb20AAAAIbmlzdHAyNTYAAABBBADyyMivoeJ3YXHVEeWa1JmUCAXfnjSBt5zZs8jwG8Myyc8Hqnlju6gPfn1TsJbTadidrgoQhAb+pGwAE2ZWP4EAAAAVc3NoOmpvaG5Ac3RhY2tocGMuY29t johng
                sk-ecdsa-sha2-nistp256@openssh.com AAAAInNrLWVjZHNhLXNoYTItbmlzdHAyNTZAb3BlbnNzaC5jb20AAAAIbmlzdHAyNTYAAABBBH5yTu713UZ1aMHJ5Bg9BZ+2hByrKO88erR9vu+WBAB0dd1EseQIz16RXALs4loiMt5NHreshiSNbmt8PdCUTVAAAAAVc3NoOmpvaG5Ac3RhY2tocGMuY29t johng_backup
            EOT
          + "host"            = "185.45.78.150"
          + "instance"        = "2e8c57e8-466e-4bff-956d-99d19e2df41b"
          + "private_key"     = (sensitive value)
          + "user"            = "ubuntu"
        }
    }

  # openstack_networking_secgroup_rule_v2.mosh will be created
  + resource "openstack_networking_secgroup_rule_v2" "mosh" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 61000
      + port_range_min    = 60000
      + protocol          = "udp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = "74fb941d-befb-4eda-9e9f-0291b4ebfa71"
      + tenant_id         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ users = [
        # (10 unchanged elements hidden)
        "jake",
      + "johng",
        "mark",
        # (17 unchanged elements hidden)
    ]
```

</details>

#### Author ✍️@JohnGarbutt